Revit 2026 API

# TemperatureRatingTypeRemoveWireSize Method

---

Remove an existing wire size type from this temperature rating type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveWireSize(
	WireSize wireSize
)
```
```vb
Public Sub RemoveWireSize (
	wireSize As WireSize
)
```
```cpp
public:
void RemoveWireSize(
	WireSize^ wireSize
)
```
```fsharp
member RemoveWireSize :
        wireSize : WireSize -> unit
```

#### Parameters

wireSize WireSize
    The wire size type to be removed.

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace